{"data":{"site":{"siteMetadata":{"title":"Forestry Gatsby Demo"}},"markdownRemark":{"id":"e9cb7c11-408f-5975-9031-6ec98d7ed213","excerpt":"You're currently viewing a demo site built with  GatsbyJS  and  Forestry . This website is meant to demonstrate some of the features of…","html":"<p>You're currently viewing a demo site built with <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a> and <a href=\"https://forestry.io\">Forestry</a>. This website is meant to demonstrate some of the features of Forestry's CMS and how it integrates with the Gatsby static site generator, but you are encouraged to copy it, hack on it, and make it your own!</p>\n<p><a href=\"/about-the-ssg\">About Gatsby »</a></p>\n<h2>Demo Features</h2>\n<p>This demo is heavily influenced by Gatsby's <a href=\"https://www.gatsbyjs.org/docs/adding-markdown-pages/\">tutorial for using markdown</a> and Kyle Mathews' <a href=\"https://github.com/gatsbyjs/gatsby-starter-blog\">gatsby-starter-blog</a>. It is intended to serve as a starting point for developing markdown websites using Gatsby. Among its features are:</p>\n<ul>\n<li>Pages created from markdown files</li>\n<li><em>List</em> and <em>single</em> templates (add an <code>index.md</code> file to a directory to create a list page for the directory's contents)</li>\n<li>Styling with Sass and <a href=\"https://bulma.io\">Bulma</a></li>\n<li>A <em>blocks</em> template to use with Forestry's <a href=\"https://forestry.io/docs/settings/fields/blocks/\">blocks</a> page builder capability.</li>\n<li>CMS-friendly content strategy, such as defining main navigation items in a JSON file.</li>\n</ul>\n<h2>How to Use This With Forestry</h2>\n<ol>\n<li><a href=\"https://github.com/forestryio/gatsby-starter-forestry\">Fork this repo to your GitHub, GitLab, or Bitbucket userspace</a></li>\n<li><a href=\"https://app.forestry.io/signup\">Sign up for a Forestry account</a></li>\n<li>Click the <strong>Add Site</strong> button, connect to your Git provider, and select the repo you just forked to begin the import process.</li>\n</ol>\n<p>Alternatively, you can have Forestry copy and import this project for your with our <a href=\"https://app.forestry.io/quick-start?repo=forestryio/gatsby-starter-forestry&#x26;branch=master&#x26;engine=gatsby\">quick start</a>.</p>\n<h2>About Forestry</h2>\n<p>Forestry is a content management UI for static sites. Forestry currently supports Hugo, Jekyll, VuePress, and Gatsby, with support for more static site generators planned.</p>\n<p>Forestry works by importing your static site from a cloud Git provider like GitHub, GitLab, or Bitbucket. You can then use our WYSIWYG and front matter UI to edit your markdown content and data files. When you save your content, Forestry creates a commit and pushes it back to your Git provider. This capability allows Forestry to be used alongside other workflows a team may be using to edit their static sites.</p>\n<p><a href=\"https://forestry.io\">Learn more at Forestry.io »</a></p>","frontmatter":{"title":"What is this?","date":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/about-the-demo/"}}